import 'package:live_beer/app/constants/enums.dart';
import 'package:live_beer/app/data/models/news.dart';
import 'package:live_beer/gen/assets.gen.dart';

class NewsData {
  static final List<NewsModel> allNews = [
    NewsModel(
      title: 'Новые сорта крафта уже в наличии в магазинах',
      date: '20.01.2022',
      type: NewsButtonType.news,
      image: Assets.images.testImage1.path,
      largeImage: Assets.images.largeImage.path,
      description:
          'Пролистайте каталог ProStore, который действителен от 5.4.2022 до 18.4.2022, чтобы ознакомиться с самыми актуальными предложениями. На 16 страницах текущего каталога, Вы найдёте лучшие товары из категории Супермаркеты и гипермаркеты. Каталог сети магазинов ProStore предлагает скидки на более, чем 155 продуктов, поэтому Вы можете быть уверены в том, что Вы совершаете покупку, используя лучшее предложение! Если Вы хотите сэкономить при своём следующем походе в магазин ProStore, не забудьте просмотреть весь каталог от первой до последней 16 страницы. На этой странице Вы найдёте акции на хлеб, лещ, пирожное, детская смесь, торт, Oreo, багет; однако, этого каталог магазина ProStore предлагает множество других скидок на такие, например, товары, как сыр, майонез, плавленый сыр, твердый сыр, чеснок, карп, шашлык, салат, фарш, овощной салат. Если Вы хотите совершать покупки с умом и сэкономить на своём следующем походе в магазин ProStore, не пропустите самый последний каталог, полный удивительных акций и замечательных скидок. Приходите на сайт Моя Акция каждый день, чтобы не пропустить отличные каталоги, предлагаемые Вашими любимыми розничными сетями.',
    ),
    NewsModel(
      title: 'Новые сорта крафта уже в наличии в магазинах',
      date: '20.01.2022',
      type: NewsButtonType.news,
      image: Assets.images.testImage1.path,
      largeImage: Assets.images.largeImage.path,
      description:
      'Пролистайте каталог ProStore, который действителен от 5.4.2022 до 18.4.2022, чтобы ознакомиться с самыми актуальными предложениями. На 16 страницах текущего каталога, Вы найдёте лучшие товары из категории Супермаркеты и гипермаркеты. Каталог сети магазинов ProStore предлагает скидки на более, чем 155 продуктов, поэтому Вы можете быть уверены в том, что Вы совершаете покупку, используя лучшее предложение! Если Вы хотите сэкономить при своём следующем походе в магазин ProStore, не забудьте просмотреть весь каталог от первой до последней 16 страницы. На этой странице Вы найдёте акции на хлеб, лещ, пирожное, детская смесь, торт, Oreo, багет; однако, этого каталог магазина ProStore предлагает множество других скидок на такие, например, товары, как сыр, майонез, плавленый сыр, твердый сыр, чеснок, карп, шашлык, салат, фарш, овощной салат. Если Вы хотите совершать покупки с умом и сэкономить на своём следующем походе в магазин ProStore, не пропустите самый последний каталог, полный удивительных акций и замечательных скидок. Приходите на сайт Моя Акция каждый день, чтобы не пропустить отличные каталоги, предлагаемые Вашими любимыми розничными сетями.',
    ),
    NewsModel(
      title: 'Новые сорта крафта уже в наличии в магазинах',
      date: '20.01.2022',
      type: NewsButtonType.news,
      image: Assets.images.testImage1.path,
      largeImage: Assets.images.largeImage.path,
      description:
      'Пролистайте каталог ProStore, который действителен от 5.4.2022 до 18.4.2022, чтобы ознакомиться с самыми актуальными предложениями. На 16 страницах текущего каталога, Вы найдёте лучшие товары из категории Супермаркеты и гипермаркеты. Каталог сети магазинов ProStore предлагает скидки на более, чем 155 продуктов, поэтому Вы можете быть уверены в том, что Вы совершаете покупку, используя лучшее предложение! Если Вы хотите сэкономить при своём следующем походе в магазин ProStore, не забудьте просмотреть весь каталог от первой до последней 16 страницы. На этой странице Вы найдёте акции на хлеб, лещ, пирожное, детская смесь, торт, Oreo, багет; однако, этого каталог магазина ProStore предлагает множество других скидок на такие, например, товары, как сыр, майонез, плавленый сыр, твердый сыр, чеснок, карп, шашлык, салат, фарш, овощной салат. Если Вы хотите совершать покупки с умом и сэкономить на своём следующем походе в магазин ProStore, не пропустите самый последний каталог, полный удивительных акций и замечательных скидок. Приходите на сайт Моя Акция каждый день, чтобы не пропустить отличные каталоги, предлагаемые Вашими любимыми розничными сетями.',
    ),
    NewsModel(
      title: 'Новые сорта крафта уже в наличии в магазинах',
      date: '20.01.2022',
      type: NewsButtonType.news,
      image: Assets.images.testImage1.path,
      largeImage: Assets.images.largeImage.path,
      description:
      'Пролистайте каталог ProStore, который действителен от 5.4.2022 до 18.4.2022, чтобы ознакомиться с самыми актуальными предложениями. На 16 страницах текущего каталога, Вы найдёте лучшие товары из категории Супермаркеты и гипермаркеты. Каталог сети магазинов ProStore предлагает скидки на более, чем 155 продуктов, поэтому Вы можете быть уверены в том, что Вы совершаете покупку, используя лучшее предложение! Если Вы хотите сэкономить при своём следующем походе в магазин ProStore, не забудьте просмотреть весь каталог от первой до последней 16 страницы. На этой странице Вы найдёте акции на хлеб, лещ, пирожное, детская смесь, торт, Oreo, багет; однако, этого каталог магазина ProStore предлагает множество других скидок на такие, например, товары, как сыр, майонез, плавленый сыр, твердый сыр, чеснок, карп, шашлык, салат, фарш, овощной салат. Если Вы хотите совершать покупки с умом и сэкономить на своём следующем походе в магазин ProStore, не пропустите самый последний каталог, полный удивительных акций и замечательных скидок. Приходите на сайт Моя Акция каждый день, чтобы не пропустить отличные каталоги, предлагаемые Вашими любимыми розничными сетями.',
    ),
    NewsModel(
      title: 'Новые сорта крафта уже в наличии в магазинах',
      date: '20.01.2022',
      type: NewsButtonType.news,
      image: Assets.images.testImage1.path,
      largeImage: Assets.images.largeImage.path,
      description:
      'Пролистайте каталог ProStore, который действителен от 5.4.2022 до 18.4.2022, чтобы ознакомиться с самыми актуальными предложениями. На 16 страницах текущего каталога, Вы найдёте лучшие товары из категории Супермаркеты и гипермаркеты. Каталог сети магазинов ProStore предлагает скидки на более, чем 155 продуктов, поэтому Вы можете быть уверены в том, что Вы совершаете покупку, используя лучшее предложение! Если Вы хотите сэкономить при своём следующем походе в магазин ProStore, не забудьте просмотреть весь каталог от первой до последней 16 страницы. На этой странице Вы найдёте акции на хлеб, лещ, пирожное, детская смесь, торт, Oreo, багет; однако, этого каталог магазина ProStore предлагает множество других скидок на такие, например, товары, как сыр, майонез, плавленый сыр, твердый сыр, чеснок, карп, шашлык, салат, фарш, овощной салат. Если Вы хотите совершать покупки с умом и сэкономить на своём следующем походе в магазин ProStore, не пропустите самый последний каталог, полный удивительных акций и замечательных скидок. Приходите на сайт Моя Акция каждый день, чтобы не пропустить отличные каталоги, предлагаемые Вашими любимыми розничными сетями.',
    ),
    NewsModel(
      title: 'Нам 10 лет повышаем скидку до 10% на всё!',
      date: '15.03.2022',
      type: NewsButtonType.discounts,
      image: Assets.images.testImage2.path,
      largeImage: Assets.images.largeImage.path,
      description:
          'Пролистайте каталог ProStore, который действителен от 5.4.2022 до 18.4.2022, чтобы ознакомиться с самыми актуальными предложениями. На 16 страницах текущего каталога, Вы найдёте лучшие товары из категории Супермаркеты и гипермаркеты. Каталог сети магазинов ProStore предлагает скидки на более, чем 155 продуктов, поэтому Вы можете быть уверены в том, что Вы совершаете покупку, используя лучшее предложение! Если Вы хотите сэкономить при своём следующем походе в магазин ProStore, не забудьте просмотреть весь каталог от первой до последней 16 страницы. На этой странице Вы найдёте акции на хлеб, лещ, пирожное, детская смесь, торт, Oreo, багет; однако, этого каталог магазина ProStore предлагает множество других скидок на такие, например, товары, как сыр, майонез, плавленый сыр, твердый сыр, чеснок, карп, шашлык, салат, фарш, овощной салат. Если Вы хотите совершать покупки с умом и сэкономить на своём следующем походе в магазин ProStore, не пропустите самый последний каталог, полный удивительных акций и замечательных скидок. Приходите на сайт Моя Акция каждый день, чтобы не пропустить отличные каталоги, предлагаемые Вашими любимыми розничными сетями.',
    ),
    NewsModel(
      title: 'Новые сорта крафта уже в наличии в магазинах',
      date: '20.01.2022',
      type: NewsButtonType.news,
      image: Assets.images.testImage3.path,
      largeImage: Assets.images.largeImage.path,
      description:
          'Пролистайте каталог ProStore, который действителен от 5.4.2022 до 18.4.2022, чтобы ознакомиться с самыми актуальными предложениями. На 16 страницах текущего каталога, Вы найдёте лучшие товары из категории Супермаркеты и гипермаркеты. Каталог сети магазинов ProStore предлагает скидки на более, чем 155 продуктов, поэтому Вы можете быть уверены в том, что Вы совершаете покупку, используя лучшее предложение! Если Вы хотите сэкономить при своём следующем походе в магазин ProStore, не забудьте просмотреть весь каталог от первой до последней 16 страницы. На этой странице Вы найдёте акции на хлеб, лещ, пирожное, детская смесь, торт, Oreo, багет; однако, этого каталог магазина ProStore предлагает множество других скидок на такие, например, товары, как сыр, майонез, плавленый сыр, твердый сыр, чеснок, карп, шашлык, салат, фарш, овощной салат. Если Вы хотите совершать покупки с умом и сэкономить на своём следующем походе в магазин ProStore, не пропустите самый последний каталог, полный удивительных акций и замечательных скидок. Приходите на сайт Моя Акция каждый день, чтобы не пропустить отличные каталоги, предлагаемые Вашими любимыми розничными сетями.',
    ),
    NewsModel(
      title: 'Нам 10 лет повышаем скидку до 10% на всё!',
      date: '15.03.2022',
      type: NewsButtonType.discounts,
      image: Assets.images.testImage4.path,
      largeImage: Assets.images.largeImage.path,
      description:
          'Пролистайте каталог ProStore, который действителен от 5.4.2022 до 18.4.2022, чтобы ознакомиться с самыми актуальными предложениями. На 16 страницах текущего каталога, Вы найдёте лучшие товары из категории Супермаркеты и гипермаркеты. Каталог сети магазинов ProStore предлагает скидки на более, чем 155 продуктов, поэтому Вы можете быть уверены в том, что Вы совершаете покупку, используя лучшее предложение! Если Вы хотите сэкономить при своём следующем походе в магазин ProStore, не забудьте просмотреть весь каталог от первой до последней 16 страницы. На этой странице Вы найдёте акции на хлеб, лещ, пирожное, детская смесь, торт, Oreo, багет; однако, этого каталог магазина ProStore предлагает множество других скидок на такие, например, товары, как сыр, майонез, плавленый сыр, твердый сыр, чеснок, карп, шашлык, салат, фарш, овощной салат. Если Вы хотите совершать покупки с умом и сэкономить на своём следующем походе в магазин ProStore, не пропустите самый последний каталог, полный удивительных акций и замечательных скидок. Приходите на сайт Моя Акция каждый день, чтобы не пропустить отличные каталоги, предлагаемые Вашими любимыми розничными сетями.',
    ),
    NewsModel(
      title: 'Новые сорта крафта уже в наличии в магазинах',
      date: '20.01.2022',
      type: NewsButtonType.news,
      image: Assets.images.testImage1.path,
      largeImage: Assets.images.largeImage.path,
      description:
          'Пролистайте каталог ProStore, который действителен от 5.4.2022 до 18.4.2022, чтобы ознакомиться с самыми актуальными предложениями. На 16 страницах текущего каталога, Вы найдёте лучшие товары из категории Супермаркеты и гипермаркеты. Каталог сети магазинов ProStore предлагает скидки на более, чем 155 продуктов, поэтому Вы можете быть уверены в том, что Вы совершаете покупку, используя лучшее предложение! Если Вы хотите сэкономить при своём следующем походе в магазин ProStore, не забудьте просмотреть весь каталог от первой до последней 16 страницы. На этой странице Вы найдёте акции на хлеб, лещ, пирожное, детская смесь, торт, Oreo, багет; однако, этого каталог магазина ProStore предлагает множество других скидок на такие, например, товары, как сыр, майонез, плавленый сыр, твердый сыр, чеснок, карп, шашлык, салат, фарш, овощной салат. Если Вы хотите совершать покупки с умом и сэкономить на своём следующем походе в магазин ProStore, не пропустите самый последний каталог, полный удивительных акций и замечательных скидок. Приходите на сайт Моя Акция каждый день, чтобы не пропустить отличные каталоги, предлагаемые Вашими любимыми розничными сетями.',
    ),
    NewsModel(
      title: 'Нам 10 лет повышаем скидку до 10% на всё!',
      date: '15.03.2022',
      type: NewsButtonType.discounts,
      image: Assets.images.testImage2.path,
      largeImage: Assets.images.largeImage.path,
      description:
          'Пролистайте каталог ProStore, который действителен от 5.4.2022 до 18.4.2022, чтобы ознакомиться с самыми актуальными предложениями. На 16 страницах текущего каталога, Вы найдёте лучшие товары из категории Супермаркеты и гипермаркеты. Каталог сети магазинов ProStore предлагает скидки на более, чем 155 продуктов, поэтому Вы можете быть уверены в том, что Вы совершаете покупку, используя лучшее предложение! Если Вы хотите сэкономить при своём следующем походе в магазин ProStore, не забудьте просмотреть весь каталог от первой до последней 16 страницы. На этой странице Вы найдёте акции на хлеб, лещ, пирожное, детская смесь, торт, Oreo, багет; однако, этого каталог магазина ProStore предлагает множество других скидок на такие, например, товары, как сыр, майонез, плавленый сыр, твердый сыр, чеснок, карп, шашлык, салат, фарш, овощной салат. Если Вы хотите совершать покупки с умом и сэкономить на своём следующем походе в магазин ProStore, не пропустите самый последний каталог, полный удивительных акций и замечательных скидок. Приходите на сайт Моя Акция каждый день, чтобы не пропустить отличные каталоги, предлагаемые Вашими любимыми розничными сетями.',
    ),
    NewsModel(
      title: 'Новые сорта крафта уже в наличии в магазинах',
      date: '20.01.2022',
      type: NewsButtonType.news,
      image: Assets.images.testImage3.path,
      largeImage: Assets.images.largeImage.path,
      description:
          'Пролистайте каталог ProStore, который действителен от 5.4.2022 до 18.4.2022, чтобы ознакомиться с самыми актуальными предложениями. На 16 страницах текущего каталога, Вы найдёте лучшие товары из категории Супермаркеты и гипермаркеты. Каталог сети магазинов ProStore предлагает скидки на более, чем 155 продуктов, поэтому Вы можете быть уверены в том, что Вы совершаете покупку, используя лучшее предложение! Если Вы хотите сэкономить при своём следующем походе в магазин ProStore, не забудьте просмотреть весь каталог от первой до последней 16 страницы. На этой странице Вы найдёте акции на хлеб, лещ, пирожное, детская смесь, торт, Oreo, багет; однако, этого каталог магазина ProStore предлагает множество других скидок на такие, например, товары, как сыр, майонез, плавленый сыр, твердый сыр, чеснок, карп, шашлык, салат, фарш, овощной салат. Если Вы хотите совершать покупки с умом и сэкономить на своём следующем походе в магазин ProStore, не пропустите самый последний каталог, полный удивительных акций и замечательных скидок. Приходите на сайт Моя Акция каждый день, чтобы не пропустить отличные каталоги, предлагаемые Вашими любимыми розничными сетями.',
    ),
    NewsModel(
      title: 'Нам 10 лет повышаем скидку до 10% на всё!',
      date: '15.03.2022',
      type: NewsButtonType.discounts,
      image: Assets.images.testImage4.path,
      largeImage: Assets.images.largeImage.path,
      description:
          'Пролистайте каталог ProStore, который действителен от 5.4.2022 до 18.4.2022, чтобы ознакомиться с самыми актуальными предложениями. На 16 страницах текущего каталога, Вы найдёте лучшие товары из категории Супермаркеты и гипермаркеты. Каталог сети магазинов ProStore предлагает скидки на более, чем 155 продуктов, поэтому Вы можете быть уверены в том, что Вы совершаете покупку, используя лучшее предложение! Если Вы хотите сэкономить при своём следующем походе в магазин ProStore, не забудьте просмотреть весь каталог от первой до последней 16 страницы. На этой странице Вы найдёте акции на хлеб, лещ, пирожное, детская смесь, торт, Oreo, багет; однако, этого каталог магазина ProStore предлагает множество других скидок на такие, например, товары, как сыр, майонез, плавленый сыр, твердый сыр, чеснок, карп, шашлык, салат, фарш, овощной салат. Если Вы хотите совершать покупки с умом и сэкономить на своём следующем походе в магазин ProStore, не пропустите самый последний каталог, полный удивительных акций и замечательных скидок. Приходите на сайт Моя Акция каждый день, чтобы не пропустить отличные каталоги, предлагаемые Вашими любимыми розничными сетями.',
    ),
  ];

  static List<NewsModel> getByType(NewsButtonType type) {
    return allNews.where((news) => news.type == type).toList();
  }

  static List<Map<String, dynamic>> getAllAsMap() {
    return allNews.map((news) => news.toMap()).toList();
  }

  static List<Map<String, dynamic>> getMapByType(NewsButtonType type) {
    return allNews
        .where((news) => news.type == type)
        .map((news) => news.toMap())
        .toList();
  }
}
